var w = [],
        t = [],
        c = [];
var teacher = ["女友", "男友", "女性朋友", "男性朋友", "女生", "女同学", "女老师", "姐妹",
        "闺蜜", "男生", "男同学", "男老师", "兄弟", "朋友", "爱人", "异性朋友", "外国人"],

        family = ["老婆", "老公", "妈妈", "爸爸", "奶奶", "爷爷", "婆婆", "公公", "父母", "老人",
                "女儿", "儿子", "姐姐", "妹妹", "哥哥", "弟弟", "岳母", "岳父", "小女孩",
                "小男孩"],
        other = ["客户", "领导", "同事", "老板", "中年人", "病人", "医生", "上司", "员工", "长辈",
                "孩子", "婴儿", "宝宝", "小学生", "初中生", "高中生", "大学生", "学生",
                "大学生", "学生", "老师", "同学"],
        birth = ["生日礼物", "生子", "满月", "怀孕", "周岁", "祝寿", "百天", "本命年礼物",
                "十岁礼物", "成年", "20岁礼物", "30岁礼物", "40岁礼物", "50岁礼物",
                "60岁礼物"],
        marry = ["结婚礼物", "结婚纪念", "金婚礼物", "银婚礼物", "订婚", "婚庆礼品", "恋爱礼物",
                "约会礼物", "表白礼物", "暗恋", "见面", "异地恋", "情侣礼物", "纪念礼物"],
        courtesy = ["商务礼品", "开业礼品", "祝贺", "拜访礼品", "乔迁", "搬家", "感谢礼物",
                "道歉礼物", "探病礼物", "年会", "升学礼物", "毕业礼物", "升职礼物", "促销",
                "庆典", "福利礼品", "会议"],
        originality = ["个性定制", "新奇特", "创意杯子", "创意灯", "相册", "水晶定制",
                "巧克力", "鲜花速递", "订蛋糕", "糖果", "暖手宝"],
        ornament = ["打火机", "女表", "男表", "儿童手表", "女包", "男包", "儿童包", "化妆镜", "钥匙扣",
                "梳子", "皮带", "丝巾","内衣袜","手机壳","男士配饰"],
        goods= ["日用品","装饰品","健康礼物","文具","户外运动","美妆护肤","香水","枕头","特色美食","工艺品",
                "汽车礼品","小家电","母婴用品","老人礼品","床头灯","花瓶"],
        comprehensive = ["阳光罐","零食礼包", "木刻画", "闹钟", "铅笔", "沙漏", "Kitty", "小黄人", "动漫礼物",
                "音乐礼物", "发光礼物","剃须刀"],
        toys = ["毛绒玩具", "抱枕", "音乐盒", "DIY小屋", "存钱罐", "婚庆公仔", "儿童玩具", "电动玩具"],
        figure = ["耳机", "充电宝", "音响", "U盘", "鼠标键盘", "游戏机", "相机", "播放器", "电子教育"],
        jewelry = ["女士项链","男士项链","女士手链","手镯","女士戒指","男士戒指","耳饰","其他饰品"]
w.push(teacher);
w.push(family);
w.push(other);
t.push(birth);
t.push(marry);
t.push(courtesy);
c.push(originality);
c.push(ornament);
c.push(goods);
c.push(comprehensive);
c.push(toys);
c.push(jewelry);
c.push(figure);
export const who = w;
export const target = t;
export const classfity = c;